#+OPTIONS: toc:t
#+PROPERTY: header-args:sh :results output
*** TODO Improve filename completion
Vcsh provides a list of all files tracked by all repositories:
#+BEGIN_SRC sh :dir ~
  vcsh list-tracked
#+END_SRC

#+RESULTS:
#+begin_example
/home/mn/.bash_logout
/home/mn/.bashrc
/home/mn/.config/byobu/status
/home/mn/.config/byobu/statusrc
/home/mn/.config/byobu/.tmux.conf
/home/mn/.config/systemd/user/emacs.service
/home/mn/.config/tmux/inx
/home/mn/.config/tmux/xless
/home/mn/.emacs.d/custom.el
/home/mn/.emacs.d/emacs.org
/home/mn/.emacs.d/init.el
/home/mn/.profile
/home/mn/.tmux.conf
#+end_example

or a specific one:
#+BEGIN_SRC sh :dir ~
vcsh list-tracked emacs
#+END_SRC

#+RESULTS:
: /home/mn/.config/systemd/user/emacs.service
: /home/mn/.emacs.d/custom.el
: /home/mn/.emacs.d/emacs.org
: /home/mn/.emacs.d/init.el

Use this feature to provide more fine-grained completion for repositories and files.

#+BEGIN_SRC emacs-lisp :tangle no
  (defconst tramp-vcsh-file-name-handler-alist
    '((expand-file-name . tramp-vcsh-handle-expand-file-name)))

  (add-to-list 'tramp-foreign-file-name-handler-alist
               (cons tramp-vcsh-method 'tramp-vcsh-file-name-handler-alist))

  (defsubst tramp-vcsh-file-name-p (filename)
    "Check if it's a filename for VCSH."
    (let ((v (tramp-dissect-file-name filename)))
      (string= (tramp-file-name-method v) tramp-vcsh-method)))
#+END_SRC
*** TODO Register Vcsh as VC backend
#+BEGIN_SRC emacs-lisp :tangle no
  (add-to-list 'vc-handled-backends 'Vcsh)
#+END_SRC
#+BEGIN_SRC emacs-lisp :results silent :tangle no
  (defvar vc-vcsh-master-templates nil "Templates for Vcsh")

  (provide 'vc-vcsh)
#+END_SRC

#+BEGIN_SRC emacs-lisp :results pp output :tangle no :dir ~
  (split-string (shell-command-to-string "vcsh list-tracked"))
#+END_SRC

#+RESULTS:
: ("/home/mn/.bash_logout" "/home/mn/.bashrc" "/home/mn/.config/byobu/status" "/home/mn/.config/byobu/statusrc" "/home/mn/.config/byobu/.tmux.conf" "/home/mn/.config/systemd/user/emacs.service" "/home/mn/.config/tmux/inx" "/home/mn/.config/tmux/xless" "/home/mn/.emacs.d/custom.el" "/home/mn/.emacs.d/emacs.org" "/home/mn/.emacs.d/init.el" "/home/mn/.profile" "/home/mn/.tmux.conf")
*** TODO Special block of type =_UML=
#+BEGIN_SRC org
  ,#+BEGIN_UML
    Alice -> Bob: Authentication Request
    Bob --> Alice: Authentication Response
  ,#+END_UML
#+END_SRC
should be available after installing
#+BEGIN_SRC emacs-lisp
  (el-get-bundle org-export-blocks-format-plantuml
    :type http
    :url "https://raw.github.com/emacsmirror/emacswiki.org/master/org-export-blocks-format-plantuml.el")
#+END_SRC
While [[http://orgmode.org/worg/org-contrib/org-exp-blocks.html][org-exp-blocks.el — pre-process blocks when exporting org files]] still using =org-exp-blocks=, it should not be used anymore:
#+BEGIN_SRC sh :dir ~/.emacs.d/el-get/org-mode :tangle no :exports results
  git show --summary ee3b3eb42
#+END_SRC

#+RESULTS:
#+begin_example
commit ee3b3eb421e74339119d730a5bf896a070b2ed60
Author: Bastien Guerry <bzg@altern.org>
Date:   Sat Mar 2 10:26:22 2013 +0100

    Remove contrib/oldexp/.

    If users want to use the old exporter, they now need
    to checkout an earlier version of Org.

 delete mode 100644 contrib/oldexp/README
 delete mode 100644 contrib/oldexp/org-ascii.el
 delete mode 100644 contrib/oldexp/org-beamer.el
 delete mode 100644 contrib/oldexp/org-docbook.el
 delete mode 100644 contrib/oldexp/org-exp-bibtex.el
 delete mode 100644 contrib/oldexp/org-exp-blocks.el
 delete mode 100644 contrib/oldexp/org-exp.el
 delete mode 100644 contrib/oldexp/org-export-generic.el
 delete mode 100644 contrib/oldexp/org-freemind.el
 delete mode 100644 contrib/oldexp/org-html.el
 delete mode 100644 contrib/oldexp/org-icalendar.el
 delete mode 100644 contrib/oldexp/org-jsinfo.el
 delete mode 100644 contrib/oldexp/org-latex.el
 delete mode 100644 contrib/oldexp/org-lparse.el
 delete mode 100644 contrib/oldexp/org-odt.el
 delete mode 100644 contrib/oldexp/org-publish.el
 delete mode 100644 contrib/oldexp/org-special-blocks.el
 delete mode 100644 contrib/oldexp/org-taskjuggler.el
 delete mode 100644 contrib/oldexp/org-xoxo.el
 delete mode 100644 contrib/oldexp/org2rem.el
#+end_example

